//=====================================================================
// 
// タイトル画面 [endless.h]
// Author : Kaito Iwasaki
//
//=====================================================================

//*********************************************************************
// 
// ***** インクルードファイル *****
// 
//*********************************************************************
#include "endless.h"
#include "player.h"
#include "bullet.h"
#include "enemy.h"
#include "input.h"
#include "fade.h"
#include "decal.h"
#include "score.h"
#include "ranking.h"
#include "font.h"

//*********************************************************************
// 
// ***** マクロ定義 *****
// 
//*********************************************************************


//*********************************************************************
// 
// ***** グローバル変数 *****
// 
//*********************************************************************
FONT* g_pFontHit = NULL;

//=====================================================================
// 初期化処理
//=====================================================================
void InitEndless(void)
{
	InitFont();

	InitDecal();

	InitPlayer();

	InitBullet();

	g_pFontHit = SetFont(
		FONT_LABEL_DONGURI,
		D3DXVECTOR3(0, SCREEN_VCENTER - 200, 0),
		D3DXVECTOR3(SCREEN_WIDTH, 200.0f, 0.0f),
		D3DXVECTOR3_ZERO,
		D3DXCOLOR_WHITE,
		100,
		"",
		DT_CENTER
	);

	GetPlayer()->nPlayerLeft = 1;
}

//=====================================================================
// 終了処理
//=====================================================================
void UninitEndless(void)
{
	UninitFont();

	UninitDecal();

	UninitPlayer();

	UninitBullet();
}

//=====================================================================
// 更新処理
//=====================================================================
void UpdateEndless(void)
{
	UpdatePlayer();

	UpdateBullet();

	sprintf(&g_pFontHit->aText[0], "%d", GetPlayer()->nCountHit);
}

//=====================================================================
// 終了処理
//=====================================================================
void DrawEndless(void)
{
	DrawDecal();

	DrawPlayer();

	DrawFont();

	DrawBullet();
}
