//=====================================================================
// 
// タイトル画面 [game.h]
// Author : Kaito Iwasaki
//
//=====================================================================

//*********************************************************************
// 
// ***** インクルードファイル *****
// 
//*********************************************************************
#include "game.h"
#include "player.h"
#include "bullet.h"
#include "enemy.h"
#include "effect.h"
#include "input.h"
#include "fade.h"
#include "decal.h"
#include "score.h"
#include "ranking.h"

//*********************************************************************
// 
// ***** マクロ定義 *****
// 
//*********************************************************************


//*********************************************************************
// 
// ***** グローバル変数 *****
// 
//*********************************************************************


//=====================================================================
// 初期化処理
//=====================================================================
void InitGame(void)
{
	InitDecal();
	InitScore();

	InitPlayer();

	InitBullet();

	InitEnemy();

	InitEffect();
}

//=====================================================================
// 終了処理
//=====================================================================
void UninitGame(void)
{
	UninitDecal();

	UninitScore();

	UninitPlayer();

	UninitBullet();

	UninitEnemy();

	UninitEffect();
}

//=====================================================================
// 更新処理
//=====================================================================
void UpdateGame(void)
{
	UpdatePlayer();

	UpdateScore();

	UpdateBullet();

	UpdateEnemy();

	UpdateEffect();

	if (GetEndingTimer() <= 0 && GetFade().state == FADESTATE_NONE)
	{
		SetFade(SCENE_RESULT);
		SaveScore(GetScore());
	}
}

//=====================================================================
// 終了処理
//=====================================================================
void DrawGame(void)
{
	DrawDecal();

	DrawPlayer();

	DrawBullet();

	DrawEnemy();

	DrawScore();

	DrawEffect();
}
