//=====================================================================
// 
// リザルト画面 [result.h]
// Author : Kaito Iwasaki
//
//=====================================================================

//*********************************************************************
// 
// ***** インクルードファイル *****
// 
//*********************************************************************
#include "result.h"
#include "player.h"
#include "input.h"
#include "fade.h"
#include "decal.h"
#include "font.h"
#include "ranking.h"

//*********************************************************************
// 
// ***** マクロ定義 *****
// 
//*********************************************************************


//*********************************************************************
// 
// ***** グローバル変数 *****
// 
//*********************************************************************


//=====================================================================
// 初期化処理
//=====================================================================
void InitResult(void)
{
	InitDecal();
	InitFont();
	InitRanking();

	// タイトル画像を配置
	SetDecal(
		DECAL_LABEL_TITLE,
		D3DXVECTOR3(SCREEN_CENTER, SCREEN_VCENTER, 0),
		D3DXVECTOR3(SCREEN_WIDTH, SCREEN_HEIGHT, 0),
		D3DXVECTOR3_ZERO,
		D3DXCOLOR(1.0f, 0.0f, 0.0f, 1.0f)
	);

	// テキストを配置
	SetFont(
		FONT_LABEL_DEFAULT,
		D3DXVECTOR3(0, SCREEN_VCENTER, 0),
		D3DXVECTOR3(SCREEN_WIDTH, 200, 0),
		D3DXVECTOR3_ZERO,
		D3DXCOLOR(1.0f, 1.0f, 0.0f, 1.0f),
		200,
		"にはは",
		DT_CENTER
	);
}

//=====================================================================
// 終了処理
//=====================================================================
void UninitResult(void)
{
	UninitDecal();
	UninitFont();
	UninitRanking();
}

//=====================================================================
// 更新処理
//=====================================================================
void UpdateResult(void)
{
	if (GetKeyboardTrigger(DIK_RETURN))
	{
		SetFade(SCENE_TITLE);
	}
}

//=====================================================================
// 終了処理
//=====================================================================
void DrawResult(void)
{
	DrawDecal();
	DrawFont();
	DrawRanking();
}
